[Demo_Shinobu_End_bad GG2CollectionDemoScript]
DemoScripts[0]=(Actor=FADE,Command=SET,SecTime=0,FadeColor=FADE_COLOR_WHITE,FadePriority=FADE_PRIO_FRONT)
DemoScripts[1]=(Actor=CAMERA,Command=SET,SetType=POS,Vec=(X=500,Y=-8800,Z=1253),SecTime=)
DemoScripts[2]=(Actor=CAMERA,Command=SET,SetType=ROT,Vec=(X=-90,Y=-5,Z=0),SecTime=)
DemoScripts[3]=(Actor=CHARACTER,Command=POP,Name="カミゾノ　マヤ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.70_KAMIZONO_MAYA',Vec=(X=497,Y=-8610,Z=1118),VecSub=(X=-90,Y=0,Z=0),CId=70)
DemoScripts[4]=(Actor=SYSTEM,Command=INIT_WAIT)
DemoScripts[5]=(Actor=CHARACTER,Command=ACTION,Name="カミゾノ　マヤ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.70_KAMIZONO_MAYA',motionName[0]="my_CE_0002_lp_open_perplex",motionName[1]="my_CM_0000_fx_close_normal",motionName[2]="my_DM_0100_lp_Stand",Rate=0,Number=3,Bit=5)
DemoScripts[6]=(Actor=BGM,Command=PLAY,SecTime=0,SoundID=SoundCue'GG2_BGM_DM_CMN_Uneasy.GG2_BGM_DM_CMN_Uneasy_Cue')
DemoScripts[7]=(Actor=AMBIENT,Command=PLAY,SecTime=0,SoundID=SoundCue'AMB_Park_2.GG2_AMB_Park_2_LP_Cue')
DemoScripts[8]=(Actor=FADE,Command=EXIT,SecTime=1,FadeColor=FADE_COLOR_WHITE,FadePriority=FADE_PRIO_FRONT)
DemoScripts[9]=(Actor=FADE,Command=WAIT)
DemoScripts[10]=(Actor=WINDOW,Command=SET)
DemoScripts[11]=(Actor=TEXT,Command=SET,ID=TEXT01)
DemoScripts[12]=(Actor=VOICE,Command=PLAY,SoundID=SoundCue'V_DM_Shinobu_End_bad.GG2_V_Shinobu_End_bad_002_Cue',Name="")
DemoScripts[13]=(Actor=TEXT,Command=SET,ID=TEXT02)
DemoScripts[14]=(Actor=VOICE,Command=STOP,SoundID=,Name="")
DemoScripts[15]=(Actor=TEXT,Command=SET,ID=TEXT03)
DemoScripts[16]=(Actor=VOICE,Command=PLAY,SoundID=SoundCue'V_DM_Shinobu_End_bad.GG2_V_Shinobu_End_bad_004_Cue',Name="")
DemoScripts[17]=(Actor=TEXT,Command=SET,ID=TEXT04)
DemoScripts[18]=(Actor=VOICE,Command=STOP,SoundID=,Name="")
DemoScripts[19]=(Actor=VOICE,Command=PLAY,SoundID=SoundCue'V_DM_Shinobu_End_bad.GG2_V_Shinobu_End_bad_005_Cue',Name="")
DemoScripts[20]=(Actor=TEXT,Command=SET,ID=TEXT05)
DemoScripts[21]=(Actor=VOICE,Command=STOP,SoundID=,Name="")
DemoScripts[22]=(Actor=WINDOW,Command=EXIT)
DemoScripts[23]=(Actor=CAMERA,Command=MOVE,SetType=ROT,Vec=(X=90,Y=-5,Z=0),SecTime=1)
DemoScripts[24]=(Actor=SYSTEM,Command=WAIT,SecTime=2)
DemoScripts[25]=(Actor=CAMERA,Command=SET,SetType=ROT,Vec=(X=90,Y=-5,Z=0),SecTime=)
DemoScripts[26]=(Actor=WINDOW,Command=SET)
DemoScripts[27]=(Actor=TEXT,Command=SET,ID=TEXT06)
DemoScripts[28]=(Actor=BGM,Command=STOP,SecTime=1,SoundID=)
DemoScripts[29]=(Actor=CHARACTER,Command=ACTION,Name="カミゾノ　マヤ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.70_KAMIZONO_MAYA',motionName[0]="my_CE_0202_lp_half_perplex",motionName[1]="my_CM_0000_fx_close_normal",motionName[2]="my_DM_0107_fx_Stand2Depressed",Rate=0,Number=3,Bit=1)
DemoScripts[30]=(Actor=CHARACTER,Command=ACTION,Name="カミゾノ　マヤ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.70_KAMIZONO_MAYA',motionName[2]="my_DM_0700_lp_Depressed",Number=8)
DemoScripts[31]=(Actor=SYSTEM,Command=WAIT,SecTime=1)
DemoScripts[32]=(Actor=BGM,Command=PLAY,SecTime=0,SoundID=SoundCue'GG2_BGM_DM_CMN_Gag.GG2_BGM_DM_CMN_Gag_Cue')
DemoScripts[33]=(Actor=VOICE,Command=PLAY,SoundID=SoundCue'V_DM_Shinobu_End_bad.GG2_V_Shinobu_End_bad_007_Cue',Name="カミゾノ　マヤ")
DemoScripts[34]=(Actor=TEXT,Command=SET,ID=TEXT07)
DemoScripts[35]=(Actor=VOICE,Command=STOP,SoundID=,Name="")
DemoScripts[36]=(Actor=VOICE,Command=PLAY,SoundID=SoundCue'V_DM_Shinobu_End_bad.GG2_V_Shinobu_End_bad_008_Cue',Name="カミゾノ　マヤ")
DemoScripts[37]=(Actor=TEXT,Command=SET,ID=TEXT08)
DemoScripts[38]=(Actor=VOICE,Command=STOP,SoundID=,Name="")
DemoScripts[39]=(Actor=TEXT,Command=SET,ID=TEXT09)
DemoScripts[40]=(Actor=VOICE,Command=PLAY,SoundID=SoundCue'V_DM_Shinobu_End_bad.GG2_V_Shinobu_End_bad_010_Cue',Name="")
DemoScripts[41]=(Actor=TEXT,Command=SET,ID=TEXT10)
DemoScripts[42]=(Actor=VOICE,Command=STOP,SoundID=,Name="")
DemoScripts[43]=(Actor=TEXT,Command=SET,ID=TEXT11)
DemoScripts[44]=(Actor=VOICE,Command=PLAY,SoundID=SoundCue'V_DM_Shinobu_End_bad.GG2_V_Shinobu_End_bad_012_Cue',Name="")
DemoScripts[45]=(Actor=TEXT,Command=SET,ID=TEXT12)
DemoScripts[46]=(Actor=VOICE,Command=STOP,SoundID=,Name="")
DemoScripts[47]=(Actor=WINDOW,Command=EXIT)
DemoScripts[48]=(Actor=CAMERA,Command=MOVE,SetType=ROT,Vec=(X=90,Y=45,Z=0),SecTime=0.3)
DemoScripts[49]=(Actor=SYSTEM,Command=WAIT,SecTime=0.3)
DemoScripts[50]=(Actor=CAMERA,Command=SET,SetType=ROT,Vec=(X=90,Y=45,Z=0),SecTime=)
DemoScripts[51]=(Actor=SYSTEM,Command=WAIT,SecTime=0.3)
DemoScripts[52]=(Actor=WINDOW,Command=SET)
DemoScripts[53]=(Actor=TEXT,Command=SET,ID=TEXT13)
DemoScripts[54]=(Actor=VOICE,Command=PLAY,SoundID=SoundCue'V_DM_Shinobu_End_bad.GG2_V_Shinobu_End_bad_014_Cue',Name="")
DemoScripts[55]=(Actor=TEXT,Command=SET,ID=TEXT14)
DemoScripts[56]=(Actor=VOICE,Command=STOP,SoundID=,Name="")
DemoScripts[57]=(Actor=VOICE,Command=PLAY,SoundID=SoundCue'V_DM_Shinobu_End_bad.GG2_V_Shinobu_End_bad_015_Cue',Name="カミゾノ　マヤ")
DemoScripts[58]=(Actor=TEXT,Command=SET,ID=TEXT15)
DemoScripts[59]=(Actor=VOICE,Command=STOP,SoundID=,Name="")
DemoScripts[60]=(Actor=WINDOW,Command=EXIT)
DemoScripts[61]=(Actor=SOUND,Command=PLAY,SoundID=SoundCue'SE_DM_Shinobu_End_bad.GG2_SE_DM_Crow_Cue')
DemoScripts[62]=(Actor=SYSTEM,Command=WAIT,SecTime=1)
DemoScripts[63]=(Actor=FADE,Command=SET,SecTime=2,FadeColor=FADE_COLOR_WHITE,FadePriority=FADE_PRIO_FRONT)
DemoScripts[64]=(Actor=SYSTEM,Command=WAIT,SecTime=1)
DemoScripts[65]=(Actor=BGM,Command=STOP,SecTime=2,SoundID=)
DemoScripts[66]=(Actor=AMBIENT,Command=STOP,SecTime=2,SoundID=)
DemoScripts[67]=(Actor=SYSTEM,Command=WAIT,SecTime=2)
DemoScripts[68]=(Actor=SYSTEM,Command=END)

[Select_Shinobu_End_bad GG2CollectionSelect]
Selects[0]=(Label="SELECT00",SelectNumber=5,Select[0]=(TextLabel="SELECT01",Goto="JUMP01",ParamType=NO_PARAM,ParamNum=0),Select[1]=(TextLabel="SELECT02",Goto="JUMP02",ParamType=NO_PARAM,ParamNum=0),Select[2]=(TextLabel="SELECT03",Goto="JUMP03",ParamType=NO_PARAM,ParamNum=0),Select[3]=(TextLabel="SELECT04",Goto="JUMP04",ParamType=NO_PARAM,ParamNum=0),Select[4]=(TextLabel="SELECT05",Goto="JUMP05",ParamType=NO_PARAM,ParamNum=0))
Selects[1]=(Label="SELECT01",SelectNumber=5,Select[0]=(TextLabel="SELECT06",Goto="JUMP06",ParamType=NO_PARAM,ParamNum=0),Select[1]=(TextLabel="SELECT07",Goto="JUMP07",ParamType=NO_PARAM,ParamNum=0),Select[2]=(TextLabel="SELECT08",Goto="JUMP08",ParamType=NO_PARAM,ParamNum=0),Select[3]=(TextLabel="SELECT09",Goto="JUMP09",ParamType=NO_PARAM,ParamNum=0),Select[4]=(TextLabel="SELECT10",Goto="JUMP10",ParamType=NO_PARAM,ParamNum=0))

[Text_Shinobu_End_bad GG2CollectionText]
Texts[0]=(Label="TEXT01",Name="峯大",Text="雖然來到公園了,不過......")

Texts[1]=(Label="TEXT02",Name="艾可蘿",Text="忍大人......不在耶.")

Texts[2]=(Label="TEXT03",Name="峯大",Text="小忍該不會察覺到/n叫她出來的人是我了吧......?")

Texts[3]=(Label="TEXT04",Name="艾可蘿",Text="不,這還不清楚./n也有可能只是遲到而已......")

Texts[4]=(Label="TEXT05",Name="真夜",Text="峯哥......")

Texts[5]=(Label="TEXT06",Name="峯大",Text="小真夜?/n小忍呢......")

Texts[6]=(Label="TEXT07",Name="真夜",Text="對不起......小忍她/n突然打電話過來....../n說她改變心意了......")

Texts[7]=(Label="TEXT08",Name="真夜",Text="她要我向峯哥轉達/n\"從今以後也要當好朋友\"/n這樣......")

Texts[8]=(Label="TEXT09",Name="峯大",Text="怎......怎麼這樣......")

Texts[9]=(Label="TEXT10",Name="艾可蘿",Text="等等!/n那該怎麼辦啊!/n再這樣下去......")

Texts[10]=(Label="TEXT11",Name="峯大",Text="一輩子都沒有女朋友......")

Texts[11]=(Label="TEXT12",Name="艾可蘿",Text="我也會......被做很不得了的事......")

Texts[12]=(Label="TEXT13",Name="峯大",Text="嗚哇啊啊啊!!!",Format[0]=(Size=37,Start=0,End=8))

Texts[13]=(Label="TEXT14",Name="艾可蘿",Text="我不要啊--!!",Format[0]=(Size=37,Start=0,End=10))

Texts[14]=(Label="TEXT15",Name="真夜",Text="峯哥,打起精神來吧?/n我把我的糖,給你......好嗎?")

Texts[15]=(Label="",Name="",Text="")

Texts[16]=(Label="SELECT01",Name="",Text="")

Texts[17]=(Label="SELECT02",Name="",Text="")

Texts[18]=(Label="SELECT03",Name="",Text="")

Texts[19]=(Label="SELECT04",Name="",Text="")

Texts[20]=(Label="SELECT05",Name="",Text="")

Texts[21]=(Label="SELECT06",Name="",Text="")

Texts[22]=(Label="SELECT07",Name="",Text="")

Texts[23]=(Label="SELECT08",Name="",Text="")

Texts[24]=(Label="SELECT09",Name="",Text="")

Texts[25]=(Label="SELECT10",Name="",Text="")


